Autodesk.Revit.DB.Electrical.CableTrayShape
Shape types enum of cable tray
Enum of cable tray shape

Autodesk.Revit.DB.Electrical.CableTrayShape.Ladder
Ladder cable tray shape.

Autodesk.Revit.DB.Electrical.CableTrayShape.Channel
Channel cable tray shape.

Autodesk.Revit.DB.Electrical.CableTrayShape.Invalid
Invalid cable tray shape.